using System;

namespace GameServer
{
    /// <summary>
    /// 프로토콜 정의.
    /// 서버에서 클라이언트로 가는 패킷 : S -> C
    /// 클라이언트에서 서버로 가는 패킷 : C -> S
    /// </summary>
    public enum PROTOCOL : short
    {
        //-------------------------------------
        // 0 이하는 종료코드로 사용되므로 게임에서 쓰지 말것!!
        //-------------------------------------
        BEGIN = 0,


        //-------------------------------------
        // 로비 프로토콜.
        //-------------------------------------
        // C -> S 게임방 입장 요청.
        ENTER_GAME_ROOM_REQ = 1,

        // S -> C 게임장 입장 요청에 대한 응답.
        ENTER_GAME_ROOM_ACK = 2,

        // S -> C 매칭이 성공했다. 방에 입장하고 로딩을 시작해라.
        START_LOADING = 3,

        // 동시 접속자 정보 요청/응답.
        CONCURRENT_USERS = 4,



        //-------------------------------------
        // 게임 프로토콜.
        //-------------------------------------
        // C -> S 게임방 리소스 로딩을 완료했다. 게임을 시작해도 좋다.
        READY_TO_START = 10,

        // 게임 시작.
        GAME_START = 11,

        // 턴 시작.
        START_PLAYER_TURN = 12,

        // 클라이언트의 이동 요청.
        MOVING_REQ = 13,

        // 플레이어가 이동 했음을 알린다.
        PLAYER_MOVED = 14,

        // 클라이언트의 턴 연출이 끝났음을 알린다.
        TURN_FINISHED_REQ = 15,

        // 게임 종료.
        GAME_OVER = 16,

        // 방이 삭제됨.
        ROOM_REMOVED = 17,

        END
    }
}
